--Основное вещество
INSERT INTO [Main substance]
	VALUES
	(N'Парацетамол'),
	(N'Ибупрофен'),
	(N'Левоментол'),
	(N'Валериана'),
	(N'Глицин'),
	(N'Гексэтидин'),
	(N'Гидрохлорид'),
	(N'Дезлоратадин'),
	(N'Пакреатин'),
	(N'Активированный уголь')

--Раздел
INSERT INTO [Section]
	VALUES
	(N'Обезболивающее'),
	(N'Жаропонижающее'),
	(N'Противовоспалительное'),
	(N'Успокоительное'),
	(N'Противоинфекционные'),
	(N'Противоаллергенные'),
	(N'От отравления')

--Болезнь
INSERT INTO [Disease]
	VALUES
	(N'Зубная боль'),
	(N'Боль'),
	(N'Температура'),
	(N'Воспаление слизистой'),
	(N'Стресс'),
	(N'Бессоница'),
	(N'Инфекция кожи'),
	(N'Аллергия'),
	(N'Отравление')

--Производитель
INSERT INTO [Producer]
	VALUES
	(N'Р-Фарм'),
	(N'Пфайзер'),
	(N'Фармстандарт'),
	(N'AstraZeneca')

--Лекарство
INSERT INTO [Medicine]
	VALUES
	(N'Пенталгин', N'Пенталгин обезбаливающее лекарство', 
	200, 150, 1, 1, 1),
	(N'Терафлю', N'Терафлю лекарство жаропонижающее и обезбаливающее', 
	250, 200, 1, 2, 3),
	(N'Парацетамол', N'Парацетамол в таблетках от боли', 
	100, 50, 1, 1, 1),
	(N'Нурофен', N'Лекарство жаропонижающее Нурофен', 
	200, 150, 2, 2, 2),
	(N'Пектусин', N'Пектусин лекарство противовоспалительное', 
	300, 250, 3, 3, 1),
	(N'Гексорал', N'Противоинфекционное лекарство', 
	300, 250, 6, 5, 4),
	(N'Персен', N'Успокоительное Персен', 
	250, 200, 4, 4, 3),
	(N'Глицин', N'Глицин в таблетках от стресса и бессоницы', 
	100, 50, 5, 4, 2),
	(N'Корвалол', N'Корвалол таблетки от бессоницы', 
	200, 150, 4, 4, 1),
	(N'Дезлоратадин', N'Дезлоратадин в таблетках от аллергии', 
	100, 50, 8, 6, 1),
	(N'Зодак', N'Зодак таблетки от аллергии', 
	150, 100, 7, 6, 2),
	(N'Супрастин', N'Супрастин противоаллергенное лекарство от отравления', 
	300, 250, 7, 6, 3),
	(N'Но-шпа', N'Но-шпа от отравления таблетки', 
	150, 100, 7, 7, 1),
	(N'Мезим', N'Мезим, здорово желудку с ним', 
	200, 150, 9, 7, 3),
	(N'Активированный уголь', N'Активированный уголь от отравления', 
	50, 20, 10, 7, 3),
	(N'Пакреатин', N'Пакреатин в таблетках от отравления', 
	100, 50, 9, 7, 4)

--Товар
INSERT INTO [Product]
	VALUES
	(25, convert(date, '2024-12-03'), 1),
	(70, convert(date, '2025-03-05'), 3),
	(50, convert(date, '2025-02-18'), 4),
	(100, convert(date, '2025-08-10'), 7),
	(20, convert(date, '2024-12-15'), 9),
	(200, convert(date, '2026-12-12'), 15),
	(50, convert(date, '2025-03-04'), 13),
	(45, convert(date, '2024-12-15'), 11),
	(60, convert(date, '2025-05-12'), 12),
	(70, convert(date, '2025-07-16'), 6)

--Статус
INSERT INTO [Status]
	VALUES
	(N'Не обработан'),
	(N'Завершен'), 
	(N'Доставка'), 
	(N'Обработка')

--Заказ
INSERT INTO [Order]
	VALUES
	(convert(date, '2024-11-02'), default,  3, 3),
	(convert(date, '2024-10-15'), default,  2, 3),
	(convert(date, '2024-11-04'), default,  1, 4)

--Продавец
INSERT INTO [Seller]
	VALUES
	(N'Петрова Екатерина Константиновна'),
	(N'Большеков Кирилл Андреевич')

--Покупатель
INSERT INTO [Buyer]
	VALUES
	(N'Миринина Светлана Иванова'),
	(N'Корневиц Александр Сергеевич'),
	(N'Шалина Наталья Владимировна'),
	(N'Державин Андрей Ильич')

--Продажа
INSERT INTO [Sale]
	VALUES
	(convert(date, '2024-09-11'), default,  1, 3),
	(convert(date, '2024-10-11'), default,  2, 1),
	(convert(date, '2024-10-17'), default,  2, 2),
	(convert(date, '2024-02-15'), default,  1, 4)

--Список болезней в лекарстве
INSERT INTO [Medicine_Disease]
	VALUES
	(1,1),
	(1,2),
	(2,3),
	(3,1),
	(4,3),
	(5,4),
	(6,7),
	(7,5),
	(7,6),
	(8,5),
	(9,5),
	(9,6),
	(10,8),
	(11,8),
	(12,8),
	(13,9),
	(14,9),
	(15,9),
	(16,9)

--Список товаров в заказе
INSERT INTO [Product_Order]
	VALUES
	(4,1,10),
	(7,3,6),
	(10,2,60)

--Список товаров в продаже
INSERT INTO [Product_Sale]
	VALUES
	(3,1,2),
	(6,4,2),
	(8,3,4),
	(10,2,3)